import { Scene } from '../../../../types';

export const day1ScenesPart9: Record<string, Scene> = {
  'F102-TalkWithFain': {
    id: 'F102-TalkWithFain',
    title: '再遇芬因',
    particleType: 'evening',
    paragraphs: [
      { text: '很快有人来叩你的门。' },
      { text: '“进来。”' },
      { text: '你以为是侍女，没想到来的却是芬因·里德。' },
      { text: '“凯茜！”' },
      { text: '他换了身衣服——是的，你发现了，这是一身更体面、更有派头、也更像骑士的着装。\n你的目光不由自主地在他仍然耀眼的金发和温柔的海蓝眼睛上停留，但很快，你移开了视线。' },
      { text: '“凯茜？”' },
      { text: '见你没反应，他凑近了。这下你更是背过身，干脆不理他。' },
      { text: '“凯茜，你怎么了？你生气了吗？发生了什么事情？”' },
      { text: '他不说还好，一说你的怒火就夹杂着委屈爆发了。' },
      { text: '你竟敢一整天都不在我的身边，还好意思问我怎么了？！', isThought: true },
      { text: '“凯茜？凯茜？你是不是生气我白天没在这？我正要......”' },
      { text: '“你走开。”你像小兽一样低吼，“你给我走开！”' },
      { text: '芬因被你吼得一愣，他不知所措。紧接着， he 向前一步，一把抱住了你。' },
      { text: '“对不起。”他恳切地向你道歉，“我错了，凯茜，我应该在你身边的。”' },
      { text: '“你也知道？”你一开口，眼泪却流了下来。芬因·里德的怀抱还是很温暖，你转过身，抓着他的肩膀，整个人缩在他的怀中。\n你感到自己在发抖。' },
      { text: '“你把我一个人扔在这......”你哭泣着，“我好害怕，芬因，你怎么能离开我？你——你到底去了哪里？为什么也不和我说？”' },
      { text: '说着说着，你还没有完全消下去的心头火又被点燃。\n这一次你恨恨地捶了他的肩膀，铁似的手感让你更生气了。' },
      { text: '“放开我！”你大叫，“我不要你抱，放开！”' },
      { text: '他松开了怀抱，你顺势跑到床边，用枕头埋住自己。\n过了一会儿，你从枕头里露出一只眼睛，看向芬因的方向。' },
      { text: '你的骑士没有离开。他单膝跪在你的床边，关切而愧疚地看着你。\n他没有离开。' },
      { text: '你砸了一个枕头。随后，你坐起来，伸手去捧他的脸，紧紧地抱住他。' },
      { text: '“你不要再走了，芬。”你闷闷地说，“你是我的骑士，你去哪里，要先告诉我。不管谁对你下命令，你都要先征得我的同意。”' },
      { text: '他抚摸着你的脊背。“我不会再让你一个人呆在这，凯茜。”你心爱的少年在你耳边发誓，“我去哪里，都会先告诉你。如果你不让我去，我就不去了。”' },
      { text: '你终于破涕为笑，重重点了一下头。' },
      { text: '“嗯！”' },
      { text: '你们拥抱了一会儿，夕阳晒在你的窗棂，婚妇的裙裾将你们淹没。\n等你从他的怀里抬起头，才想起一件事——' },
      { text: '今天晚上，你要去哈蒙德府上用晚餐。' }
    ],
    choices: [
      { text: '继续', nextSceneId: 'F102-1-attendafeast', affect: { finn: 3 } }
    ]
  },

  'F102-1-attendafeast': {
    id: 'F102-1-attendafeast',
    title: '赴宴的准备',
    particleType: 'evening',
    paragraphs: [
      { text: '“芬，来不及了。”' },
      { text: '你几乎是从他怀里跳起来：“侍女！我需要梳妆更衣，要快！”' },
      { text: '先前得到过女官长命令的几位侍女鱼贯而入。为了节省时间，你站在床边，方便她们给你换衣服、梳头发、拿毛巾来擦去脸上的泪痕。\n你感到眼睛有点疼。' },
      { text: '芬因在你换衣服时就被请了出去。他站在门外，十分困惑：“凯茜？”' },
      { text: '换完衣服，你让侍女开门，把他放进来。\n“听着，芬。”面对镜子，你的表情严肃而认真，“我今晚要去外面吃晚餐，但我不能带你。大骑士在哪？”' },
      { text: '尽管你很想带芬因去，但你早就想到，芬因也是一个孩子。\n他只有十四岁，而乔治·哈蒙德，这个男人那么高——那么年长——芬因现在还不能让你在面对乔治·哈蒙德时感到安心。' },
      { text: '“师父被穿深蓝罩袍的人找走了。”芬因说，“凯茜，你没事吗？”' },
      { text: '叫走了。' },
      { text: '你闭了闭眼睛，再次睁开时，心中已经有了两个人选。' }
    ],
    choices: [
      { text: '帮我找罗德里克·索恩爵士过来。', nextSceneId: 'F102-2-RoderickThorn', affect: { roderick: 2 }, setFlags: { 'knight_at_feast': 'roderick' } },
      { text: '科尔宾·米德爵士现在在哪？', nextSceneId: 'F102-3-CorbinMide', affect: { corbin: 2 }, setFlags: { 'knight_at_feast': 'corbin' } }
    ]
  },

  'F102-2-RoderickThorn': {
    id: 'F102-2-RoderickThorn',
    title: '他为你叫来了罗德里克·索恩',
    particleType: 'evening',
    paragraphs: [
      { text: '“陛下。”' },
      { text: '红袍卫队队长的声音在门口响起。芬因动作迅速，没让你多等。' },
      { text: '“索恩爵士，很高兴能在这时见到你。”你对他说，“今晚，你需要陪同我去哈蒙德府邸参与晚宴。”' },
      { text: '他对你颔首。\n你站起来，长长的晚礼服裙摆拖到脚面。你选的这身裙子上有着金底红狐的纹章。' },
      { text: '“走吧。”' }
    ],
    choices: [
      { text: '继续', nextSceneId: 'F103-1-withRoderickThorn' }
    ]
  },

  'F102-3-CorbinMide': {
    id: 'F102-3-CorbinMide',
    title: '科尔宾·米德对你鞠躬',
    particleType: 'evening',
    paragraphs: [
      { text: '“陛下。”' },
      { text: '仍然是这个温和的声音。芬因动作迅速，没让你多等。' },
      { text: '“米德爵士，很高兴能在这时见到你。”你对他说，“今晚，你需要陪同我去哈蒙德府邸参与晚宴。”' },
      { text: '他对你颔首。\n你站起来，长长的晚礼服裙摆拖到脚面。你选的这身裙子上有着金底红狐的纹章。' },
      { text: '“走吧。”' }
    ],
    choices: [
      { text: '继续', nextSceneId: 'F103-2-withCorbinMide' }
    ]
  }
};
