import { Scene } from '../../types';

export const deerAct1Scenes: Record<string, Scene> = {
  'd1-deer': {
    id: 'd1-deer',
    title: '巧艺之子',
    description: '达里安简介',
    paragraphs: [
      { text: '达里安·德·雷斯多，雷斯多伯爵的第四子，是雷斯多里最小的一个。' },
      { text: '不幸的是，你有三个哥哥，他们都比你年长很多；幸运的是，你有三个哥哥。' },
      { text: '他们都很爱护你，不止因为你是最小的弟弟，还因为你与他们不同的天赋。' },
      { text: '他们在南境的马上和林地长大，狩猎、习剑、摔跤；你在南境的黑河旁成长，写诗、弹琴、思虑。\n这使得他们后来夺得武艺的荣耀，而你被称为巧艺的达米。' },
      { text: '你一半喜欢这个称呼，一半讨厌这个称呼。它诉说着你在纤细灵敏的艺术方面的天分，也叹惋着你多病早弱的身体。\n你对男孩们未来之路的一切准备都兴致缺缺，这使你的人生早早偏向了诗人的道路。' },
      { text: '你偶尔想，我长大了。长大后的我，会成为怎样的诗人？' },
      { text: '车窗外是南境连绵的葡萄园，空气中弥漫着逐渐芳美的气息。\n颠簸的马车正载着你与你的父兄，驶向王城。' },
      { text: '很快，你就会知道答案。' }
    ],
    choices: [
      { text: '继续', nextSceneId: 'd2-CarriageTalk' }
    ]
  },

  'd2-CarriageTalk': {
    id: 'd2-CarriageTalk',
    title: '旅途闲谈',
    description: '马车里，你的父亲和哥哥们在谈论什么。',
    paragraphs: [
      { text: '这一年，你十四岁。这趟旅程中，大哥埃蒂安·雷斯多和妈妈吉尔瓦娜·雷斯多留在封地，你和你的二哥、三哥与父亲维克托·德·雷斯多伯爵同行。' },
      { text: '“女王陛下就要即位了。”维克托·德·雷斯多的声音低沉而平静，“我们必须尽快赶到王城。”' },
      { text: '“听说那是位‘王国之光’。”三哥菲利克斯·德·雷斯多懒洋洋地说。' },
      { text: '“她还只是个孩子。”' },
      { text: '二哥富兰克林·德·雷斯多瞥了他一眼。' },
      { text: '“我知道，哈蒙德与她订婚了。”' },
      { text: '哈蒙德？你想起这个姓氏——西境大公爵，家纹是黑鹰。财政大臣，御前首相，有秘闻与赫西夫妇的死有关系。' },
      { text: '“是哪个哈蒙德？”' }
    ],
    choices: [
      { text: '迪恩·哈蒙德', nextSceneId: 'd2-1-DeanHammond' },
      { text: '乔治·哈蒙德', nextSceneId: 'd2-2-GeorgeHammond' }
    ]
  },

  'd2-1-DeanHammond': {
    id: 'd2-1-DeanHammond',
    title: '黑鹰的新婚',
    description: '你父亲的话让两个哥哥看了过来。',
    paragraphs: [
      { text: '父亲看了你一眼，似乎并不介意你听到这些。' },
      { text: '“迪恩·哈蒙德。”他说，“乔治·哈蒙德的次子，二十出头，尚未婚配。”' },
      { text: '“真会享受，”富兰克林说，“他才二十多岁吧，虽然不是什么出色的男人，居然能娶到十四岁的少女。”' },
      { text: '“哈蒙德会对南境伸手。”' },
      { text: '菲利克斯做了判断。他撑着下巴，漫不经心地对你吹了声口哨：' },
      { text: '“达米，伯恩·斯特莱大人家的酒好喝吗？”' },
      { text: '他说的是你前几年冬天去斯特莱家族唱诗的事。你忍不住叹气：“别提了，菲力哥哥。他们家热情得过分，也嗜酒如命。”' }
    ],
    choices: [
      { text: '继续', nextSceneId: 'd3-Dissatisfied' }
    ]
  },

  'd2-2-GeorgeHammond': {
    id: 'd2-2-GeorgeHammond',
    title: '黑鹰的再婚',
    description: '你父亲的话让两个哥哥看了过来。',
    paragraphs: [
      { text: '父亲看了你一眼，似乎并不介意你听到这些。' },
      { text: '“乔治·哈蒙德。”他说，“西境大公爵，现任御前首相。”' },
      { text: '“真会享受，”富兰克林说，“他已经四十多了，很早的时候结过婚，结果很快就丧妻。这个年纪还能娶到十五岁的少女。”' },
      { text: '“哈蒙德会对南境伸手。”' },
      { text: '菲利克斯做了判断。他撑着下巴，漫不经心地对你吹了声口哨：' },
      { text: '“达米，伯恩·斯特莱大人家的酒好喝吗？”' },
      { text: '他说的是你前几年冬天去斯特莱家族唱诗的事。你忍不住叹气：“别提了，菲力哥哥。他们家热情得过分，也嗜酒如命。”' }
    ],
    choices: [
      { text: '继续', nextSceneId: 'd3-Dissatisfied' }
    ]
  },

  'd3-Dissatisfied': {
    id: 'd3-Dissatisfied',
    title: '父亲的安排',
    description: '维克托·德·雷斯多伯爵对三个儿子的叮嘱。',
    paragraphs: [
      { text: '“所以，酒后失言。”' },
      { text: '“菲力。”' },
      { text: '你的三哥识相地闭上嘴，但维克托与他交换的眼神说明了一切。\n你的三哥有些不着调，然而大哥埃蒂安·雷斯多却认为他才是兄弟中最聪明的那个。' },
      { text: '啊，风流的菲力。\n你想起他的一个戏称，但你并不怀疑大哥的话。' },
      { text: '“总之，这次王城会来很多人。”维克托说。' },
      { text: '“弗兰克，菲力，我不指望你们两能够按时回来。别玩太晚。”' },
      { text: '“达米。”' },
      { text: '他紧接着看向你：“你必须跟着我，不能乱跑。”' },
      { text: '“可是......”' }
    ],
    choices: [
      { text: '德雷大学士可能需要我。', nextSceneId: 'd3-1-ScholarNeed' },
      { text: '......好的，爸爸。', nextSceneId: 'd4-EnterCity' }
    ]
  },

  'd3-1-ScholarNeed': {
    id: 'd3-1-ScholarNeed',
    title: '德雷大学士',
    description: '你试图为自己争取一些自由。',
    paragraphs: [
      { text: '“德雷大学士可能需要我帮忙整理文书。”你说，声音里带着一丝恳求。' },
      { text: '德雷大学士是雷斯多家族顾问学士，一个头发花白、总是笑眯眯的老人。他教过你历史、天文，也教过你如何辨认草药。\n他上个月就启程回了王城，你走时给他送了信。你们会在王城的贤者堡见面。' },
      { text: '“他教过你很多东西，但这趟路程不需要你帮忙。”维克托摇头，“王城里到处都是危险，你必须待在我身边。”' }
    ],
    choices: [
      { text: '继续', nextSceneId: 'd4-EnterCity' }
    ]
  },

  'd4-EnterCity': {
    id: 'd4-EnterCity',
    title: '不服气！',
    description: '你，达里安·德·雷斯多，从小体弱多病，却拥有至纯的诗艺与灵性。',
    paragraphs: [
      { text: '你觉得不公平，凭什么！富兰克林和菲利克斯十四岁的时候不知道已经上哪野去了，而你竟然还得跟在爸爸身边？' },
      { text: '但是，你承认他是对的。' }
    ],
    choices: [
      { text: '继续', nextSceneId: 'd4-EnterCity-1' }
    ]
  },

  'd4-EnterCity-1': {
    id: 'd4-EnterCity-1',
    title: '他是对的',
    description: '',
    paragraphs: [
      { text: '你，达里安·德·雷斯多，从小体弱多病，是最小的孩子，与哥哥们年纪差得大，于是母亲吉尔瓦娜和父亲维克托非常关照你。' },
      { text: '好在七神收走了你的健康体魄和骑士的未来，又赐给你至纯的诗艺与灵性。你十四岁时，已经能撰写并演唱家族的长诗。' },
      { text: '不成为骑士，似乎也没什么大不了的。' },
      { text: '你这样想，哥哥们也这样想。富兰克林曾开玩笑让你给以后的他写武功歌，而你想自己大概还会写三哥与女人们的风流罗曼史。' },
      { text: '在过去的日子里，你已经为所有能够见到的美谱写歌颂。' },
      { text: '哑言诗人与无性无声之琴眷顾，你已经感到自己的空缺。它发自内心，犹如中空的裂缝，你不禁惊讶自己竟活了十几年才发现它。' },
      { text: '这种空虚，仿佛从你出生时就存在，只是今天才被察觉。' },
      { text: '你需要新的诗歌，换言之，你需要让新的世界、新的美丽、新的灵性进入这条裂缝。' },
      { text: '你忧愁地认为，自己将再没有可能填满这一道灵魂。毕竟，你已经很久没有真正地离开家了。' },
      { text: '“我们很快就要到了，孩子们。”维克托说，“王城。”' }
    ],
    choices: [
      { text: '进入王城', nextSceneId: 'start' }
    ]
    //d5-Intramuro
  }
};
