import { Scene } from "../../../../types";

export const day2Scenes10: Record<string, Scene> = {
  "F137-Dinner": {
    id: "F137-Dinner",
    title: "晚餐",
    paragraphs: [
      { text: "暮色渐移。\n你回到红堡，在侍女的陪伴下走进餐厅。" },
      { text: "长桌除了你之外空空如也，你决定......" }
    ],
    choices: [
      { text: "自己吃", nextSceneId: "F138-DinnerAlone" },
      { text: "为何不找我的女官们？", nextSceneId: "F139-DinnerWithSomeone" }
    ]
  },
  "F138-DinnerAlone": {
    id: "F138-DinnerAlone",
    title: "独自晚餐",
    paragraphs: [
      { text: "银盘里盛着烤得焦香的鳟鱼，浇着柠檬汁和莳萝；一碟奶油炖菜，热气袅袅；还有一小篮杂粮面包，旁边配着咸黄油。汤是洋葱汤，上面浮着一层金黄的芝士。" },
      { text: "劳累的一天耗尽了你的胃口，即使刚在花园中聆听了美妙的乐曲，你也没什么心情再与其他人交谈。" },
      { text: "一个人吃的好处是，无需过多在意餐桌礼仪。\n你很随意地用勺子舀起汤，吹了吹，小口小口地喝着。鳟鱼只吃了几口，面包掰了一小块，奶油炖菜几乎没动。" },
      { text: "很显然，你只想快点解决掉晚饭，然后，尽可能地享受独自一人的时光。" }
    ],
    choices: [
      { text: "继续", nextSceneId: "F144-SecondNight" }
    ]
  },
  "F139-DinnerWithSomeone": {
    id: "F139-DinnerWithSomeone",
    title: "我想找......",
    paragraphs: [
      { text: "面向侍餐侍女，你微微点头。年轻女孩立刻上前：“陛下。”" }
    ],
    choices: [
      { text: "“去请阿尔摩恩小姐来。”", nextSceneId: "F140-DinnerCecile" },
      { text: "“维里克小姐可以与我同席。”", nextSceneId: "F141-DinnerYulia" },
      { text: "“斯特莱小姐用餐了吗？”", nextSceneId: "F142-DinnerAlaina" },
      { text: "“我要和朗贝尔小姐一起用餐。”", nextSceneId: "F143-DinnerLisa" }
    ]
  },
  "F140-DinnerCecile": {
    id: "F140-DinnerCecile",
    title: "与塞西尔共餐",
    paragraphs: [
      { text: "塞西尔·阿尔摩恩来到你的身边，你注意到她换了身衣服——和白天那条裙子不同。\n这条裙子的颜色是深蓝灰色的，像北境冬日夜晚的天空，领口和袖口绣着银色的剑藤花纹，腰间系着一条细银链。" },
      { text: "她优雅地对你行礼，随后坐在了你的右手边。" },
      { text: "“晚上好，陛下。”" },
      { text: "你看着她的脸，再次默默地想，她和杜林确实有些相像。\n不过......" },
      { text: "不过，还是她比较好。" },
      { text: "你们聊了会天。塞西尔看出你的疲惫，大部分时间里只是她在分享，你作为倾听，时不时表达自己的看法。\n从她的话语里，你知道她和你一样，是第一次来到王宫。" },
      { text: "“这里真的很大。”塞西尔说，“和家里很不一样。”" },
      { text: "是的。你咽下嘴里的食物，确实很不一样。" }
    ],
    choices: [
      { text: "继续", nextSceneId: "F144-SecondNight", affect: { cecile: 2 } }
    ]
  },
  "F141-DinnerYulia": {
    id: "F141-DinnerYulia",
    title: "与尤利娅共餐",
    paragraphs: [
      { text: "尤利娅·维里克在你的右手边入座，这张脸孔和早上相比，似乎也有一丝疲惫。" },
      { text: "“晚上好，陛下。”她对你行礼，随后为你倒茶。" },
      { text: "与她共餐是一种十分安静的体验，你发现倘若你不主动开启话题，她也不会贸然说话。\n刀叉与餐盘的轻微响动变成你们之间唯一的话语，但尤利娅始终注意着你的需要。" },
      { text: "对于这种陪伴，你并不排斥。\n也许还因为，你现在并不想说话。" },
      { text: "除了吃饭，你还在漫无目的地观察她。\n她的眼睛.....她的头发.....她细长而削瘦的手指......" },
      { text: "等她带着一点询问意味地抬起眼睛，你才发现自己盯了她太长时间。" },
      { text: "就像被某种宝石，某种动物，某种现象吸引。\n你对她露出微笑，而尤利娅为你奉茶。" }
    ],
    choices: [
      { text: "继续", nextSceneId: "F144-SecondNight", affect: { yulia: 2 } }
    ]
  },
  "F142-DinnerAlaina": {
    id: "F142-DinnerAlaina",
    title: "与阿莱娜共餐",
    paragraphs: [
      { text: "你对自己想要和阿莱娜共餐并不意外。\n你知道她是个斯特莱，她看起来还是个虔信徒，经历了这两天，你决定要主动观察斯特莱们。伯恩和他的长子长女让你感到危险而遥远，而你......你身边的这个，看起来更好接近。" },
      { text: "她在你的右手边入座，礼仪无可挑剔。七星圣纹的吊坠在她的胸前晃动，你注意到这枚吊坠的工艺似乎很精致。" },
      { text: "“你的吊坠。”你说，“给我看一看。”" },
      { text: "阿莱娜丝毫没有感到意外。她将双手探到颈后，解下这条吊坠递给你。" },
      { text: "有点沉。", isThought: true },
      { text: "很好的工艺。精致......有分量......细节也做得很好。\n七颗星星排成圆环，中间嵌着一颗小小的透明宝石。每一颗星的边缘都镶着细密的金丝，在烛光下泛着柔和的光。" },
      { text: "“这是我的伴护修女在我第十三个恩典日为我从[L:圣泉大教堂]取来的。”\n七星圣纹吊坠在你手中转到第三圈时，阿莱娜适时地开口，“如今，这是我佩戴的第三年，陛下。”" },
      { text: "你把吊坠还给了她。“圣泉大教堂？”" },
      { text: "你知道那个地方，这是河间地的一座著名教堂，圣阿尔芒娜为其加护。\n那座圣泉听说至今仍在泊泊流淌。" },
      { text: "“你很虔诚，斯特莱小姐。”你漫不经心地说，“七神曾眷顾过你吗？”" },
      { text: "她对你微笑，“总是如此。”" },
      { text: "你低头啜饮杯中的茶水。总是如此.....你想，那我是否能让她去帮我找一找玛格丽特修女的下落？" },
      { text: "这个想法一旦成形，你立刻又想到另一个问题：阿莱娜·斯特莱会帮我吗？去凯斯大圣堂，面对大主教？" },
      { text: "“陛下？”" },
      { text: "你想了想，打算之后找到合适的机会再提此事。" },
      { text: "“我也希望七神眷顾我。”你说，“斯特莱小姐，请你为我多多地祈祷吧。”" },
      { text: "阿莱娜微微睁大了眼睛，那个温和的笑容在她脸上变深了。\n“这是我的荣幸，陛下。”" }
    ],
    choices: [
      { text: "继续", nextSceneId: "F144-SecondNight", affect: { alaina: 2 } }
    ]
  },
  "F143-DinnerLisa": {
    id: "F143-DinnerLisa",
    title: "与丽莎共餐",
    paragraphs: [
      { text: "丽莎·朗贝尔对于你的传召看起来并不惊讶，甚至是早已料到。\n她在你的右手边入席，妆容精致，衣裙美丽，整个人看起来精心打扮，令你赏心悦目。" },
      { text: "“感谢您的邀请，陛下。”丽莎对对露出微笑，“我想这会是一次很棒的晚餐。”" },
      { text: "也许是她的精神感染了你，你感到一天的疲惫消解了一些。\n“有你在时总会这样，朗贝尔小姐。”你说，“你看起来真不错。”" },
      { text: "珍珠耳饰在她小巧的耳垂上轻轻晃动。就这样，晚餐开始了。" },
      { text: "她很健谈，也很自信，却并不会让你感到不适。\n你早在早晨见面时就发现了这件事，因此你料定，她确实相当有说话的本事。" },
      { text: "丽莎比你知道得要多得多，你想她知道的事情快和学士的徒弟差不多了。\n这些知识都是从哪来的呢？" },
      { text: "你不打算追问，至少现在不打算。\n徜徉在丽莎为你编织的奇闻中并不是什么坏事，而且你确实需要好好地放松一下。" },
      { text: "况且，她确实是一位非常会找话题，让你感到舒适的女孩。" }
    ],
    choices: [
      { text: "继续", nextSceneId: "F144-SecondNight", affect: { lisa: 2 } }
    ]
  }
};
