import { Scene } from "../../../../types";

export const day2Scenes11: Record<string, Scene> = {
  "F144-SecondNight": {
    id: "F144-SecondNight",
    title: "芬因的守夜",
    paragraphs: [
      { text: "夜晚，你仍然抱着枕头，把被子拖到门口。" },
      { text: "“芬。”你小声呼唤你的男孩，“你在哪？”" },
      { text: "“我在这，凯茜。”芬因同样小声地回答你，“就在你的门口。”" },
      { text: "“你现在在做什么？”\n“我正坐在地上，和你说话。”" },
      { text: "你笑了一声。热水洗去了你的疲惫，现在的时间完全属于你——属于你和芬因。\n“我今天见了很多人。”你对他说，“还去了红廷，那里是王宫里最大的房间。”" },
      { text: "“红廷？”\n“嗯，就是要举行册封典礼的地方，我听说......”" },
      { text: "你将白天彩排的事情和他分享，说到兴起处，你忿忿不平：“凯安爵士和科尔宾爵士在休息间隙一直在说话，但我不能说！”" },
      { text: "“现在我陪你说话，凯茜。”芬因安慰你，“你想说多少都行。”" },
      { text: "聊着聊着，你比昨晚更早感到困倦。\n也许是因为今天没怎么见到让你不舒服的人，也许是今天的行程排的太满，又也许是因为你已经开始习惯这样的夜晚......你打了个哈欠。" },
      { text: "“芬，我今天......还在花园见到了一个男孩。”\n“是什么样的？”" },
      { text: "“他说他叫达里安，是南境的贵族......”\n“是吗......”" },
      { text: "“唱歌很好听，唔......”\n你的意识逐渐滑入黑暗，“但是芬，还是你......”" },
      { text: "“只有你，你是最好的，最好的......”" }
    ],
    choices: [
      { text: "未完待续（返回主菜单）", nextSceneId: "start" }
    ],
    onEnter: (state) => {
      state.flags['relationship.finn'] = Math.max(0, Math.min(100, ((state.flags['relationship.finn'] as number) || 0) + 2));
    }
  }
};
